KHIEM2812/auto_quad_fc/stm32_pmsm_foc/System & drive params/Parameters conversion motor 2.h
/**
  ******************************************************************************
  * @file    Parameters conversion motor 2.h
  * @author  IMS Systems Lab and Technical Marketing - MC Team
  * @version 3.0
  * @date    05-Apr-2011 11:34
  * @brief   This file contains motor parameters needed by STM32 PMSM MC FW  
  *          library v3.0
  ******************************************************************************
  * <br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PARAMETERS_CONVERSION_MOTOR2_H
#define __PARAMETERS_CONVERSION_MOTOR2_H

#include "Definitions.h"
#include "PMSM motor 2 parameters.h"
#include "Drive parameters motor 2.h"
#include "Power stage parameters motor 2.h"
#include "Control stage parameters motor 2.h"
#include "stm32f10x.h"

#include "Power stage parameters.h"
/************************* CPU & ADC PERIPHERAL CLOCK CONFIG ******************/

#if defined CPU_CLK_72_MHZ
#define ADC_CLOCK_DIVIDER2  RCC_PCLK2_Div6
#define ADV_TIM_CLK_MHz2    72uL
#define ADC_CLK_MHz2        12uL
#define ADC_CLK_MHz2        12uL
#define HALL_TIM_CLK2       SYSCLK_FREQ_72MHz

#elif defined CPU_CLK_56_MHZ
#define ADC_CLOCK_DIVIDER2  RCC_PCLK2_Div4
#define ADV_TIM_CLK_MHz2    56uL
#define ADC_CLK_MHz2        14uL
#define ADC_CLK_MHz2        14uL
#define HALL_TIM_CLK2       SYSCLK_FREQ_56MHz

#elif defined CPU_CLK_48_MHZ
#define ADC_CLOCK_DIVIDER2  RCC_PCLK2_Div4
#define ADV_TIM_CLK_MHz2    48uL
#define ADC_CLK_MHz2        12uL
#define ADC_CLK_MHz2        12uL
#define HALL_TIM_CLK2       SYSCLK_FREQ_48MHz

#elif defined CPU_CLK_24_MHZ
#define ADC_CLOCK_DIVIDER2  RCC_PCLK2_Div2
#define ADV_TIM_CLK_MHz2    24uL
#define ADC_CLK_MHz2        12uL
#define ADC_CLK_MHz2        12uL
#define HALL_TIM_CLK2       SYSCLK_FREQ_24MHz
#else
#endif

/************************* CONTROL FREQUENCIES & DELAIES **********************/
#define TF_REGULATION_RATE2 	(uint16_t) ((uint16_t)(PWM_FREQUENCY2)/REGULATION_EXECUTION_RATE2)
#define REP_COUNTER2 			(uint16_t) ((REGULATION_EXECUTION_RATE2 *2)-1u)

#define MEDIUM_FREQUENCY_TASK_RATE2		(uint16_t)SPEED_LOOP_FREQUENCY_HZ

#define INRUSH_CURRLIMIT_DELAY_COUNTS2  (uint16_t)(INRUSH_CURRLIMIT_DELAY_MS2 * \
				   ((uint16_t)SPEED_LOOP_FREQUENCY_HZ)/1000u -1u)

/************ SENSORLESS REV-UP PARAMETERS ************************************/
#define FIRST_SLESS_ALGO_PHASE2 (ENABLE_SL_ALGO_FROM_PHASE2-1u)  
#if OPEN_LOOP_FOC2 == ENABLE

#define OPEN_LOOP2
#undef PHASE1_DURATION2
#undef PHASE2_DURATION2
#undef PHASE3_DURATION2
#undef PHASE4_DURATION2
#undef PHASE5_DURATION2

#undef PHASE1_FINAL_SPEED_RPM2
#undef PHASE2_FINAL_SPEED_RPM2
#undef PHASE3_FINAL_SPEED_RPM2
#undef PHASE4_FINAL_SPEED_RPM2
#undef PHASE5_FINAL_SPEED_RPM2

#undef VARIANCE_THRESHOLD2
#undef CORD_VARIANCE_THRESHOLD2

/* Phase 1 */
#define PHASE1_DURATION2		    OPEN_LOOP_SPEED_RAMP_DURATION_MS2
#define PHASE1_FINAL_SPEED_RPM2	    OPEN_LOOP_SPEED_RPM2
/* Phase 2 */
#define PHASE2_DURATION2		  65535   /*milliseconds */
#define PHASE2_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2
/* Phase 3 */
#define PHASE3_DURATION2		  65535   /*milliseconds */
#define PHASE3_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2
/* Phase 4 */
#define PHASE4_DURATION2		  65535   /*milliseconds */
#define PHASE4_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2
/* Phase 5 */
#define PHASE5_DURATION2		  65535    /* milliseconds */
#define PHASE5_FINAL_SPEED_RPM2	  PHASE1_FINAL_SPEED_RPM2

#define VARIANCE_THRESHOLD2       0
#define CORD_VARIANCE_THRESHOLD2  0
#endif
/************************* OBSERVER PARAMETERS ********************************/
#define MAX_BEMF_VOLTAGE2  (uint16_t)((MOTOR_MAX_SPEED_RPM2*\
                           MOTOR_VOLTAGE_CONSTANT2*SQRT_2)/(1000u*SQRT_3))

#define MOTOR_MAX_SPEED_HZ2 (int16_t)((MOTOR_MAX_SPEED_RPM2*10u)/60u)

#if (BUS_VOLTAGE_READING2 == ENABLE)
/*max phase voltage, 0-peak Volts*/
#define MAX_VOLTAGE2 (int16_t)((MCU_SUPPLY_VOLTAGE/2)/BUS_ADC_CONV_RATIO2) 
#else
#define MAX_VOLTAGE2 (int16_t)(500/2) /* Virtual sensor conversion factor */
#endif

#ifdef ICS_SENSORS2 
#define MAX_CURRENT2 (MCU_SUPPLY_VOLTAGE/(2*AMPLIFICATION_GAIN2))
#else
#define MAX_CURRENT2 (MCU_SUPPLY_VOLTAGE/(2*RSHUNT2*AMPLIFICATION_GAIN2))
#endif

#define C12 (int32_t)((((int16_t)F12)*RS2)/(LS2*TF_REGULATION_RATE2))
#define C22 (int32_t) GAIN12
#define C32 (int32_t)((((int16_t)F12)*MAX_BEMF_VOLTAGE2)/(LS2*MAX_CURRENT2*TF_REGULATION_RATE2))
#define C42 (int32_t) GAIN22
#define C52 (int32_t)((((int16_t)F12)*MAX_VOLTAGE2)/(LS2*MAX_CURRENT2*TF_REGULATION_RATE2))

#define MOTOR_MAX_SPEED_DPP2 (int32_t)((1.2*MOTOR_MAX_SPEED_RPM2*65536u*POLE_PAIR_NUM2)\
                                                            /(TF_REGULATION_RATE2*60u))

#define FREQ_STARTUP_PWM_STEPS2 (uint32_t) ((FREQ_START_UP_DURATION2 * TF_REGULATION_RATE2)\
                                                                          /1000u) 
#define FREQ_INC2 (uint16_t) ((FINAL_START_UP_SPEED2*POLE_PAIR_NUM2*65536u/60u)\
                                                        /FREQ_STARTUP_PWM_STEPS2)
#define I_STARTUP_PWM_STEPS2 (uint32_t) ((I_START_UP_DURATION2 * TF_REGULATION_RATE2)/1000u) 
#define I_INC2 (uint16_t)((FINAL_I_STARTUP2 -FIRST_I_STARTUP2)*1024u/I_STARTUP_PWM_STEPS2)
#define PERCENTAGE_FACTOR2    (uint16_t)(VARIANCE_THRESHOLD2*128u)      
#define OBS_MINIMUM_SPEED2        (uint16_t) (OBS_MINIMUM_SPEED_RPM2/6u)

/*********************** OBSERVER + CORDIC PARAMETERS *************************/
#define CORD_C12 (int32_t)((((int16_t)CORD_F12)*RS)/(LS*TF_REGULATION_RATE))
#define CORD_C22 (int32_t) CORD_GAIN12
#define CORD_C32 (int32_t)((((int16_t)CORD_F12)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT\
                                                           *TF_REGULATION_RATE))
#define CORD_C42 (int32_t) CORD_GAIN2
#define CORD_C52 (int32_t)((((int16_t)CORD_F12)*MAX_VOLTAGE2)/(LS2*MAX_CURRENT2*\
                                                          TF_REGULATION_RATE2))
#define CORD_PERCENTAGE_FACTOR2    (uint16_t)(CORD_VARIANCE_THRESHOLD2*128u)      
#define CORD_MINIMUM_SPEED2        (uint16_t) (CORD_MINIMUM_SPEED_RPM2/6u)

