KHIEM2812/auto_quad_fc/stm32_pmsm_foc/System & drive params/Parameters conversion motor 2.h
/**************************   VOLTAGE CONVERSIONS  ****************************/
#define BUS_ADC_CONV_RATIO2       VBUS_PARTITIONING_FACTOR2

#define OVERVOLTAGE_THRESHOLD_d2   (uint16_t)(OV_VOLTAGE_THRESHOLD_V2*65535/\
                                  (MCU_SUPPLY_VOLTAGE/VBUS_PARTITIONING_FACTOR2))
#define UNDERVOLTAGE_THRESHOLD_d2  (uint16_t)((UD_VOLTAGE_THRESHOLD_V2*65535)/\
                                  ((uint16_t)(MCU_SUPPLY_VOLTAGE/\
                                                           BUS_ADC_CONV_RATIO2)))

#define INT_SUPPLY_VOLTAGE2          (uint16_t)(65536/MCU_SUPPLY_VOLTAGE)

#define DELTA_TEMP_THRESHOLD2        (OV_TEMPERATURE_THRESHOLD_C2- T0_C2)
#define DELTA_V_THRESHOLD2           (dV_dT2 * DELTA_TEMP_THRESHOLD2)
#define OV_TEMPERATURE_THRESHOLD_d2  ((V0_V2 + DELTA_V_THRESHOLD2)*INT_SUPPLY_VOLTAGE2)

#define DELTA_TEMP_HYSTERESIS2        (OV_TEMPERATURE_HYSTERESIS_C2- T0_C2)
#define DELTA_V_HYSTERESIS2           (dV_dT2 * DELTA_TEMP_HYSTERESIS2)
#define OV_TEMPERATURE_HYSTERESIS_d2  ((V0_V2 + DELTA_V_HYSTERESIS2)*INT_SUPPLY_VOLTAGE2)
														  														  
/*************************  PWM IDLE STATES AND POLARITY  *********************/														  
#define H_ACTIVE_HIGH    0x0000u //TIM_OCPolarity_High
#define H_ACTIVE_LOW     0x0002u //TIM_OCPolarity_Low
#define L_ACTIVE_HIGH    0x0000u  //TIM_OCNPolarity_High
#define L_ACTIVE_LOW     0x0008u  //TIM_OCNPolarity_Low 

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if (PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY2 == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY2  TIM_OCIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE2 == TURN_OFF)
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY2 == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY2  TIM_OCNIdleState_Reset
#endif
#endif



#if (HALL_TIMER_SELECTION2 == HALL_TIM2)
#define HALL_TIMER2 				TIM2  
#define HALL_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2  
#define HALL_IRQ_CHANNEL2  		TIM2_IRQn
#elif (HALL_TIMER_SELECTION2 == HALL_TIM3)
#define HALL_TIMER2 				TIM3  
#define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM3
#define HALL_IRQ_CHANNEL2  		TIM3_IRQn  
#elif (HALL_TIMER_SELECTION2 == HALL_TIM4)
#define HALL_TIMER2 				TIM4  
#define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM4  
#define HALL_IRQ_CHANNEL2  		TIM4_IRQn
#elif (HALL_TIMER_SELECTION2 == HALL_TIM5)
#define HALL_TIMER2 				TIM5  
#define HALL_RCC_PERIPHERAL2 	RCC_APB1Periph_TIM5
#define HALL_IRQ_CHANNEL2  		TIM5_IRQn  
#else
#endif

#if (ENC_TIMER_SELECTION2 == ENC_TIM2)
#define ENC_TIMER2 				TIM2  
#define ENC_RCC_PERIPHERAL2		RCC_APB1Periph_TIM2  
#define ENC_IRQ_CHANNEL2  		TIM2_IRQn
#elif (ENC_TIMER_SELECTION2 == ENC_TIM3)
#define ENC_TIMER2 				TIM3  
#define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM3
#define ENC_IRQ_CHANNEL2  		TIM3_IRQn  
#elif (ENC_TIMER_SELECTION2 == ENC_TIM4)
#define ENC_TIMER2 				TIM4  
#define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM4  
#define ENC_IRQ_CHANNEL2  		TIM4_IRQn
#elif (ENC_TIMER_SELECTION2 == ENC_TIM5)
#define ENC_TIMER2 				TIM5  
#define ENC_RCC_PERIPHERAL2 		RCC_APB1Periph_TIM5
#define ENC_IRQ_CHANNEL2 		TIM5_IRQn 
#else
#endif

#if (HALL_ICx_FILTER2 <= 1)
#define HALL_IC_FILTER2   0
#elif (HALL_ICx_FILTER2 <= 2)
#define HALL_IC_FILTER2   1
#elif (HALL_ICx_FILTER2 <= 6)
#define HALL_IC_FILTER2   2
#elif (HALL_ICx_FILTER2 <= 10)
#define HALL_IC_FILTER2   3
#elif (HALL_ICx_FILTER2 <= 14)
#define HALL_IC_FILTER2   4
#elif (HALL_ICx_FILTER2 <= 20)
#define HALL_IC_FILTER2   5
#elif (HALL_ICx_FILTER2 <= 28)
#define HALL_IC_FILTER2   6
#elif (HALL_ICx_FILTER2 <= 40)
#define HALL_IC_FILTER2   7
#elif (HALL_ICx_FILTER2 <= 56)
#define HALL_IC_FILTER2   8
#elif (HALL_ICx_FILTER2 <= 72)
#define HALL_IC_FILTER2   9
#elif (HALL_ICx_FILTER2 <= 88)
#define HALL_IC_FILTER2   10
#elif (HALL_ICx_FILTER2 <= 112)
#define HALL_IC_FILTER2   11
#elif (HALL_ICx_FILTER2 <= 144)
#define HALL_IC_FILTER2   12
#elif (HALL_ICx_FILTER2 <= 176)
#define HALL_IC_FILTER2   13
#elif (HALL_ICx_FILTER2 <= 224)
#define HALL_IC_FILTER2   14
#else
#define HALL_IC_FILTER2   15
#endif

#if (ENC_ICx_FILTER2 == 0)
#define ENC_IC_FILTER2   0
#elif (ENC_ICx_FILTER2 <= 2)
#define ENC_IC_FILTER2   1
#elif (ENC_ICx_FILTER2 <= 6)
#define ENC_IC_FILTER2   2
#elif (ENC_ICx_FILTER2 <= 10)
#define ENC_IC_FILTER2   3
#elif (ENC_ICx_FILTER2 <= 14)
#define ENC_IC_FILTER2   4
#elif (ENC_ICx_FILTER2 <= 20)
#define ENC_IC_FILTER2   5
#elif (ENC_ICx_FILTER2 <= 28)
#define ENC_IC_FILTER2   6
#elif (ENC_ICx_FILTER2 <= 40)
#define ENC_IC_FILTER2   7
#elif (ENC_ICx_FILTER2 <= 56)
#define ENC_IC_FILTER2   8
#elif (ENC_ICx_FILTER2 <= 72)
#define ENC_IC_FILTER2   9
#elif (ENC_ICx_FILTER2 <= 88)
#define ENC_IC_FILTER2   10
#elif (ENC_ICx_FILTER2 <= 112)
#define ENC_IC_FILTER2   11
#elif (ENC_ICx_FILTER2 <= 144)
#define ENC_IC_FILTER2   12
#elif (ENC_ICx_FILTER2 <= 176)
#define ENC_IC_FILTER2   13
#elif (ENC_ICx_FILTER2 <= 224)
#define ENC_IC_FILTER2   14
#else
#define ENC_IC_FILTER2   15
#endif

/*************** Encoder Alignemnt ************************/
    
