KHIEM2812/auto_quad_fc/stm32_pmsm_foc/System & drive params/Parameters conversion motor 2.h
#if (TEMP_ADC_SAMPLING_TIME2 == 1)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_1Cycles5
#elif (TEMP_ADC_SAMPLING_TIME2 == 7)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_7Cycles5
#elif (TEMP_ADC_SAMPLING_TIME2 == 13)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_13Cycles5
#elif (TEMP_ADC_SAMPLING_TIME2 == 28)
#define TEMP_SAMPLING_TIME2  ADC_SampleTime_28Cycles5
#endif

#define TEMP_SW_FILTER_BW_FACTOR2     250u
#define VQD_SW_FILTER_BW_FACTOR2      128u
#define VBUS_SW_FILTER_BW_FACTOR2     10u

#if (FREQ_RELATION ==  HIGHEST_FREQ) /* First instance has higher frequency */
#define PWM_FREQUENCY_CHECK_RATIO   (PWM_FREQUENCY*10000u/PWM_FREQUENCY2)
#else /* Second instance has higher frequency */
#define PWM_FREQUENCY_CHECK_RATIO   (PWM_FREQUENCY2*10000u/PWM_FREQUENCY)
#endif

#define MAGN_FREQ_RATIO   (FREQ_RATIO*10000u)

#ifdef DUALDRIVE
#if (PWM_FREQUENCY_CHECK_RATIO != MAGN_FREQ_RATIO)
#error "The two motor PWM frequencies should be integer multiple"  
#endif
#endif

#undef HIGHEST_FREQ
#undef LOWEST_FREQ
#define HIGHEST_FREQ    HIGHER_FREQ
#define LOWEST_FREQ     LOWER_FREQ

#if ((defined STATE_OBSERVER_PLL2) || (defined STATE_OBSERVER_CORDIC2))
#define NO_SPEED_SENSORS2
#endif

#if (MTPA_ENABLING2 == ENABLE)
#define IPMSM_MTPA2
#endif

#if (FEED_FORWARD_CURRENT_REG_ENABLING2 == ENABLE)
#define FEED_FORWARD_CURRENT_REGULATION2
#endif

#if (FLUX_WEAKENING_ENABLING2 == ENABLE)
#define FLUX_WEAKENING2
#endif

#if defined AUX_ENCODER
#define VIEW_ENCODER_FEEDBACK
#endif

#if defined AUX_HALL_SENSORS
#define VIEW_HALL_FEEDBACK
#endif

#ifdef SINGLE_SHUNT
#define M2FIRSTR1 FALSE
#else
#define M2FIRSTR1 TRUE
#endif

#if (defined(SINGLE_SHUNT2) || defined(THREE_SHUNT2))
#define PQD_CONVERSION_FACTOR2 (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * RSHUNT2 * AMPLIFICATION_GAIN2 ))
#endif

#if (defined(ICS_SENSORS2))
#define PQD_CONVERSION_FACTOR2 (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * AMPLIFICATION_GAIN2 ))
#endif

/****** Prepares the UI configurations according the MCconfxx settings ********/
/* Motor 2 settings */
#ifdef FLUX_WEAKENING2
  #define FW_ENABLE2 |UI_CFGOPT_FW
#else
  #define FW_ENABLE2
#endif

#ifdef DIFFERENTIAL_TERM_ENABLED2
  #define DIFFTERM_ENABLE2 |UI_CFGOPT_SPEED_KD|UI_CFGOPT_Iq_KD|UI_CFGOPT_Id_KD
#else
  #define DIFFTERM_ENABLE2
#endif

/* Sensors setting */
#ifdef STATE_OBSERVER_PLL2
  #define MAIN_SCFG2 UI_SCODE_STO_PLL
#endif

#ifdef STATE_OBSERVER_CORDIC2
  #define MAIN_SCFG2 UI_SCODE_STO_CR
#endif

#ifdef AUX_STATE_OBSERVER_PLL2
  #define AUX_SCFG2 UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC2
  #define AUX_SCFG2 UI_SCODE_STO_CR
#endif

#ifdef ENCODER2
  #define MAIN_SCFG2 UI_SCODE_ENC
#endif

#ifdef VIEW_ENCODER_FEEDBACK2
  #define AUX_SCFG2 UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS2
  #define MAIN_SCFG2 UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK2
  #define AUX_SCFG2 UI_SCODE_HALL
#endif

#ifndef AUX_SCFG2
#define AUX_SCFG2 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE2 |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE2
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/
#ifdef DUALDRIVE
  #define UI_CONFIG_M2 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE2\
    | (MAIN_SCFG2 << MAIN_SCFG_POS) | (AUX_SCFG2 << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE2 )
#endif

#endif /*__PARAMETERS_CONVERSION_MOTOR2_H*/

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
